DataProcessors/ОбработкаВыгрузкаДисконтныхКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаВыгрузкаДисконтныхКарт</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фильтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодировка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяФайла2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ОбработкаВыгрузкаДисконтныхКарт/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбъектПредставление = РеквизитФормыВЗначение("Объект");
	Объект.Фильтр = ОбъектПредставление.УстановитьФильтр();	
	Если (Элементы.СписокКодировка.СписокВыбора.Количество() = 0) Тогда
		Элементы.СписокКодировка.СписокВыбора.ЗагрузитьЗначения(ОбъектПредставление.ЗаполнитьКодировку());
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере(Кодировка)
	Если не ПустаяСтрока(Кодировка) Тогда
		Если Кодировка = "ANSI" Тогда
			XBaseКодировка =  КодировкаXBase.ANSI;
		ИначеЕсли Кодировка = "OEM" тогда	
			XBaseКодировка =  КодировкаXBase.OEM;
		КонецЕсли;	
		РеквизитФормыВЗначение("Объект").СформироватьФайл(XBaseКодировка);
	КонецЕсли;			
КонецПроцедуры

&НаСервере
Функция  ПолучитьОбъектФормы(Реквизит)
	Если не ПустаяСтрока(Реквизит) Тогда
		Возврат  РеквизитФормыВЗначение(Реквизит);	
	КонецЕсли;
КонецФункции 

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	#Если НЕ ВебКлиент Тогда
		СтандартнаяОбработка = Ложь;
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
		ДиалогВыбораФайла.Заголовок					    = "Выберите каталог";
		ДиалогВыбораФайла.ПредварительныйПросмотр		= Ложь;
		ДиалогВыбораФайла.Фильтр                        = Объект.Фильтр;
		ДиалогВыбораФайла.ПроверятьСуществованиеФайла	= Ложь;
		ДиалогВыбораФайла.МножественныйВыбор            = Ложь;  
		ДиалогВыбораФайла.Каталог = Объект.ПутьКФайлу;
		Если ДиалогВыбораФайла.Выбрать() Тогда
			Объект.ПутьКФайлу = РаботаСФайлами.НормализоватьКаталог(ДиалогВыбораФайла.Каталог);
		Иначе 
			Возврат;
		КонецЕсли;
		УстановитьПолноеИмяФайла("ИмяФайла1","ПолноеИмяФайла1");	
		УстановитьПолноеИмяФайла("ИмяФайла2","ПолноеИмяФайла2");
	#КонецЕсли	
КонецПроцедуры

&НаКлиенте
Функция УстановитьПолноеИмяФайла(РеквизитИмя, РеквизитПуть)
	Если не ПустаяСтрока(Объект[РеквизитИмя]) и не ПустаяСтрока(Объект.ПутьКФайлу) Тогда
		Объект[РеквизитПуть] = Объект.ПутьКФайлу + Объект[РеквизитИмя];
	КонецЕсли;
КонецФункции // УстановыитьПолноеИмяФайла()

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	ВыполнитьОбработкуНаСервере(Объект.Кодировка);
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)	
	Если Найти(Текст, ".dbf") = 0 Тогда
		Если УстановкаИмениФайла="Файл 1" Тогда
			Объект.ИмяФайла1 = Текст + ".dbf";
		ИначеЕсли УстановкаИмениФайла="Файл 2" Тогда
			Объект.ИмяФайла2 = Текст + ".dbf";
		КонецЕсли;
	КонецЕсли;
	УстановитьПолноеИмяФайла("ИмяФайла1","ПолноеИмяФайла1");	
	УстановитьПолноеИмяФайла("ИмяФайла2","ПолноеИмяФайла2");	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр(Команда)
	
	//Файл = ВыбратьИзСписка(Элементы.УстановкаИмениФайла.СписокВыбора, Элементы.Группа);
	// Если Файл ="Файл 1" Тогда                                    
		 ПолноеИмя = Объект.ПолноеИмяФайла1;
	 //ИначеЕсли Файл ="Файл 2" Тогда
	 //	ПолноеИмя = Объект.ПолноеИмяФайла2;
	 //КонецЕсли;
	
	Если не ПустаяСтрока(Объект.Кодировка) и не ПустаяСтрока(ПолноеИмя) Тогда
		ОткрытьФорму("Обработка.ОбработкаВыгрузкаДисконтныхКарт.Форма.ФормаПросмотра",Новый Структура("Кодировка,ПолноеИмяФайла",Объект.Кодировка, ПолноеИмя), ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Просмотр2(Команда)
	ПолноеИмя = Объект.ПолноеИмяФайла2;
	Если не ПустаяСтрока(Объект.Кодировка) и не ПустаяСтрока(ПолноеИмя) Тогда
		ОткрытьФорму("Обработка.ОбработкаВыгрузкаДисконтныхКарт.Форма.ФормаПросмотра",Новый Структура("Кодировка,ПолноеИмяФайла",Объект.Кодировка, ПолноеИмя), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановкаИмениФайлаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПериод(Команда)
	ПараметрыПериода = Новый Структура;
	ПараметрыПериода.Вставить("ДатаНачала", Объект.ДатаНачала);
	ПараметрыПериода.Вставить("ДатаОкончания", Объект.ДатаКонец);
	ПараметрыПериода.Вставить("ИнтервалПериод", Истина);	
	
	РедактированиеПериода = ПолучитьФорму("ОбщаяФорма.РедактированиеПериода", ПараметрыПериода, ЭтаФорма );
	Если РедактированиеПериода.Открыта() Тогда
		РедактированиеПериода.Активизировать();
	Иначе
		РедактированиеПериода.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПериодИзменен" Тогда
		Объект.ДатаНачала = Параметр.ДатаНачала;
		Объект.ДатаКонец = КонецДня(Параметр.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры
